
#Область СлужебныеПроцедурыИФункции

Функция СохраненныйПутьДоИнформационнойБазы() Экспорт
	
	Возврат Sentry_ВзаимодействиеСПользователямиСервер.СохраненныйПутьДоИнформационнойБазы();
		
КонецФункции

Функция ПредставлениеИнформационнойБазы() Экспорт
	
	Возврат Sentry_ОбменДаннымиПовтИсп.ПредставлениеИнформационнойБазы();
		
КонецФункции

Функция ЗначениеНастройкиПодключенияКСервису(ИмяНастройки) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);	
	Возврат РегистрыСведений.Sentry_НастройкиПодключенияКСервису.ЗначениеНастройки(ИмяНастройки);	
	
КонецФункции

Процедура ОчиститьНастройкиПриИзмененииПредставленияИнформационнойБазы() Экспорт
	
	Sentry_ВзаимодействиеСПользователямиСервер.ОчиститьНастройкиПриИзмененииПредставленияИнформационнойБазы();
		
КонецПроцедуры

Процедура ОбновитьПредставлениеИнформационнойБазыПриИзмененииНастроек() Экспорт
	
	Sentry_ВзаимодействиеСПользователямиСервер.ОбновитьПредставлениеИнформационнойБазыПриИзмененииНастроек();
		
КонецПроцедуры

Функция НаименованиеРегламентногоЗаданияSentry() Экспорт
	
	Возврат Sentry_РегламентноеЗаданиеСервер.НаименованиеРегламентногоЗаданияSentry();
	
КонецФункции

Функция СтрокаСоединенияСБД() Экспорт 
	
	Возврат Sentry_ОбменДаннымиПовтИсп.СтрокаСоединенияСБД()	

КонецФункции

#КонецОбласти