
#Область ПрограммныйИнтерфейс

Процедура ПоказатьПредупреждениеПриИзмененииРасположенияИнформационнойБазы() Экспорт
		
	СохраненныйПутьДоИнформационнойБазы = Sentry_ВзаимодействиеСПользователямиВызовСервера.СохраненныйПутьДоИнформационнойБазы();
	
	Если Не ЗначениеЗаполнено(СохраненныйПутьДоИнформационнойБазы) Тогда
		Возврат;	
	КонецЕсли;
	                                      
	СтрокаСоединенияИнформационнойБазы = Sentry_ВзаимодействиеСПользователямиВызовСервера.СтрокаСоединенияСБД();
	
	// Нашли ранее сохраненный путь до информационной базы
	Если НРег(СохраненныйПутьДоИнформационнойБазы) = НРег(СтрокаСоединенияИнформационнойБазы) Тогда
		Возврат;	
	КонецЕсли;
		
	РегламентноеЗаданиеGUID = Sentry_ВзаимодействиеСПользователямиВызовСервера.ЗначениеНастройкиПодключенияКСервису("РегламентноеЗаданиеGUID");
	
	Если Не ЗначениеЗаполнено(РегламентноеЗаданиеGUID) Тогда
		Возврат;	
	КонецЕсли; 
	
	Sentry_ВзаимодействиеСПользователямиВызовСервера.ОчиститьНастройкиПриИзмененииПредставленияИнформационнойБазы();
	
	ТекстСообщенияПользователю = СтрШаблон("%1%2%3 ""%4"" %5",
		НСтр("ru = 'Обмен с Sentry остановлен. Для повторного подключения перейдите в начальные настройки Sentry.'"),
		Символы.ПС,
		"Регламентное задание",
		Sentry_ВзаимодействиеСПользователямиВызовСервера.НаименованиеРегламентногоЗаданияSentry(),
		НСтр("ru = 'удалено. Токен интеграции с сервисом Sentry очищен.'"));
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = ТекстСообщенияПользователю;
	Сообщение.Сообщить();
		
КонецПроцедуры

#КонецОбласти

