
#Область ОбработкаСобытийПриложения

&После("ПриНачалеРаботыСистемы")
Процедура Sentry_ПриНачалеРаботыСистемы(Знач ОповещениеЗавершения, НепрерывноеВыполнение)
	
	Попытка
		
		Sentry_ВзаимодействиеСПользователямиКлиент.ПоказатьПредупреждениеПриИзмененииРасположенияИнформационнойБазы();

	Исключение
		
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
		ЖурналРегистрацииКлиент.ДобавитьСообщениеДляЖурналаРегистрации(
			"Sentry.Sentry_ПриНачалеРаботыСистемы",
			"Ошибка",
			ТекстОшибки);
			
	КонецПопытки;
		
КонецПроцедуры

#КонецОбласти
